console.log('luna is started...');

// 1.   Цифры проверяемой последовательности 
//      нумеруются справа налево.
// 2.   Цифры, оказавшиеся на нечётных местах, 
//      остаются без изменений.
// 3.   Цифры, стоящие на чётных местах, умножаются на 2.
// 4.   Если в результате такого умножения возникает число больше 9, 
//      оно заменяется суммой цифр получившегося произведения 
//      — однозначным числом, то есть цифрой.
// 5.   Все полученные в результате преобразования цифры складываются. 
//      Если сумма кратна 10, то исходные данные верны.